app/Controllers/Leafletdraw.php

    public function delete_point($id){
        $this->TbldatapointModel->delete($id);
---
DELETE FROM "tbl_data_point"
WHERE "id" IN ('3')

    public function delete_polyline($id){
        $this->TbldatapolylineModel->delete($id);
---
DELETE FROM "tbl_data_polyline"
WHERE "id" IN ('3')

    public function delete_polygon($id){
        $this->TbldatapolygonModel->delete($id);
---
DELETE FROM "tbl_data_polygon"
WHERE "id" IN ('1')